app/Controllers/RegisterController.php

    public function store()
    {
        helper(['form']);
        $rules = [
            'name'          => 'required|min_length[2]|max_length[50]',
            'email'         => 'required|min_length[4]|max_length[100]|valid_email|is_unique[users.email]'
            // 'password'      => 'required|min_length[4]|max_length[50]',
            // 'c_password'  => 'matches[password]'

        ];

        if($this->validate($rules)){
            $model = new UserModel();
            $data = [
                'name'     => $this->request->getVar('name'),
                'password' => password_hash($this->request->getVar('password'), PASSWORD_DEFAULT),
                'c_password' => password_hash($this->request->getVar('password'), PASSWORD_DEFAULT),
                'email'    => $this->request->getVar('email')


            ];
            $model->save($data);
---
INSERT INTO `users` (`name`, `password`, `c_password`, `email`) VALUES ('test', '$2y$10$L3iLTEgHy1hOdpkxNg1NZ.qqIK5NDHwEc7orS43bOlcL/VthHzEFW', '$2y$10$GnZbjwfp4nXelnFEpXsugezP3hXfI0mwT.YZLyzglVsd0F7jls/WS', 'test@gmail.com')